[
    {
        "title": "GearSim Graphic",
        "technology": "C++, Qt Core, Qt Quick",
        "description": [
            "Led a team of four members to design and develop a cross-platform, high-performance graphical user interface for GearSim, an aircraft landing gear simulation application.",
            "Handled multiple roles, such as software architect and project manager throughout the project.",
            "Completed MVP with a new and modern user interface that exceeded the sponsor’s expectations."
        ],
        "ref": "github.com/qpham0304"
    },
    {
        "title": "3D openGL playground",
        "technology": "C++, OpenGL",
        "description": [
            "Developed a 3D graphics space from scratch that represents how objects are displayed in a 3D space.",
            "Supported Lighting adjustment, shape transition, transformation, and shadow casting with real-time adjustable resolution and shading effect.",
            "Effectively displayed objects with over 100,000 vertices without having any artifacts."
        ],
        "ref": "github.com/qpham0304"
    },
    {
        "title": "JavaSwing graphic editor",
        "technology": "Java, JavaSwing",
        "description": [
            "Designed a graphic shape drawing app from scratch using JavaSwing library",
            "Applied Model-View-Controller architecture pattern to effectively divide the logic of the app",
            "Showed effective use of Java API and inheritance design"
        ],
        "ref": "github.com/qpham0304"
    },
    {
        "title": "My Portfolio",
        "technology": "React, JavaScript, HTML, CSS, Figma",
        "description": [
            "Design my own personal portfolio page from scratch with plain css and no external frameworks",
            "Demonstrate a deep understand of css and utilize its capability without relying on external libraies"
        ],
        "ref": "github.com/qpham0304"
    },
    {
        "title": "Habit Builder",
        "technology": "MongoDB, Express, React, NodeJs",
        "description": [
            "Handled a full-stack cross-platform application using the MERN stack with a separate native UI for mobile.",
            "Developed a REST API that interacts with MongoDB and handles complex queries with over 50,000 records.",
            "Securely process users’ information and their request to the server JSON Web Token as authentication."
        ],
        "ref": "github.com/qpham0304"
    },
    {
        "title": "Online Art Marketplace Database",
        "technology": "MySQL, PHP, HTML, CSS",
        "description": [
            "Created a relational database that stores artist's and customer data along with the ability to track related detail about the product",
            "Effectively design a clear relation between multiple tables",
            "Support CRUD features with a simple interface for data query"
        ],
        "ref": "github.com/qpham0304"
    },
    {
        "title": "Image Viewer",
        "technology": "React, JavaScript, HTML, CSS",
        "description": [
            "Simple and clean image viewer with responsive layout with plain css",
            "Demonstrated a deep understand of css responsive layout without relying on external libraries"
        ],
        "ref": "github.com/qpham0304"
    },
    {
        "title": "MultiMedia Player",
        "technology": "React, JavaScript, HTML, CSS, Youtube API",
        "description": [
            "Multimedia player that uses various request from google's youtube API",
            "Support create, read, update, and delete for user's selected playlist"
        ],
        "ref": "github.com/qpham0304"
    },
    {
        "title": "Auto price prediction model",
        "technology": "Python, AWS",
        "description": [
            "Trained a machine learning model to predicts car prices based on various attributes",
            "Utilized AWS to speed up the big data preprocessing and model training process",
            "Successfully optimized and improved the model to predict the car prices with up to 91% accuracy"
        ],
        "ref": "github.com/qpham0304"
    }
]